doom_emacs/.doom.d/config.org
#+TITLE: My doom configuration
#+AUTHOR: Emin Umut Gerçek
#+EMAIL: umutgercek1999@gmail.com

* Non doom
** Copy Paste
#+BEGIN_SRC emacs-lisp
(setq-default
 delete-by-moving-to-trash t
 tab-width 4
 uniquify-buffer-name-style 'forward
 window-combination-resize t
 x-stretch-cursor t)

(setq undo-limit 80000000
      evil-want-fine-undo t
      auto-save-default t
      inhibit-compacting-font-caches t
      truncate-string-ellipsis "…"
      display-line-numbers-type 'relative)
                                        ;(global-subword-mode 1)

(setq-default custom-file (expand-file-name ".custom.el" doom-private-dir))(when (file-exists-p custom-file)
                                                                             (load custom-file))

(setq writeroom-fullscreen-effect t)
#+END_SRC
** Maximize on boot
*** KILL Old
#+BEGIN_SRC emacs-lisp :tangle no
(if (eq initial-window-system 'x)
    (toggle-frame-maximized)
  (toggle-frame-fullscreen))
#+END_SRC
*** New
#+BEGIN_SRC emacs-lisp
(toggle-frame-fullscreen)
#+END_SRC
* Doom
** KILL Projectile
#+BEGIN_SRC emacs-lisp :tangle no
(setq projectile-project-search-path '("~/src/"))
#+END_SRC
** Font
#+BEGIN_SRC emacs-lisp
;; (setq doom-font (font-spec :family "SauceCodePro Nerd Font" :size 17))
(setq doom-font (font-spec :family "SauceCodePro NF" :size 17))
;; (setq doom-font (font-spec :family "JetBrains Mono" :size 15))
;; (setq doom-font (font-spec :family "Hack Nerd Font Mono" :size 15))
#+END_SRC
** User Info
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Umut Gercek"
      user-mail-address "umutgercek1999@gmail.com")
#+END_SRC
** Better Default
#+BEGIN_SRC emacs-lisp
(setq confirm-kill-emacs nil)
(unless (display-graphic-p)
  (require 'evil-terminal-cursor-changer)
  (evil-terminal-cursor-changer-activate) ; or (etcc-on)
  )
#+END_SRC
** Theme
*** Light & Dark
#+BEGIN_SRC emacs-lisp
(setq doom-solarized-dark-brighter-text t)
(setq doom-solarized-dark-brighter-comments t)
(setq doom-themes-enable-bold t)

(setq my/current-time (string-to-number (format-time-string "%H")))

(if
    (and
     (< 7 my/current-time)
     (< my/current-time 17 ))
    (setq my/current-theme 'doom-one-light)
  (setq my/current-theme 'doom-solarized-dark))

(setq doom-theme my/current-theme)
(custom-set-faces!
  `(region     :background ,"#094A5A"))
#+END_SRC
** Dashboard
#+BEGIN_SRC emacs-lisp
(setq doom-scratch-buffer-major-mode t)

(remove-hook '+doom-dashboard-functions #'doom-dashboard-widget-shortmenu)
(remove-hook '+doom-dashboard-functions 'doom-dashboard-widget-footer)
(remove-hook '+doom-dashboard-functions 'doom-dashboard-widget-loaded)

(setq fancy-splash-image "~/.doom.d/GnuLove.png")

(define-key evil-normal-state-map (kbd "C-c =") 'evil-numbers/inc-at-pt)
(define-key evil-normal-state-map (kbd "C-c -") 'evil-numbers/dec-at-pt)

(setq +evil-want-o/O-to-continue-comments nil)

(after! evil-snipe
  (setq evil-snipe-scope 'visible)
  (setq evil-snipe-repeat-scope 'buffer)
  (setq evil-snipe-spillover-scope 'whole-buffer))
#+END_SRC
** Dired
#+BEGIN_SRC emacs-lisp
(map!
  (:after dired
    (:map dired-mode-map
      :n "RET" 'dired-find-alternate-file ;;Open in same bufer
          "-"   'find-alternate-file)
          "C-x i" #'peep-dired
     ))
(evil-define-key 'normal peep-dired-mode-map (kbd "j") 'peep-dired-next-file
                                             (kbd "k") 'peep-dired-prev-file)
(add-hook 'peep-dired-hook 'evil-normalize-keymaps)
#+END_SRC
** Rainbow Deliiters
#+BEGIN_SRC emacs-lisp
(setq rainbow-delimiters-max-face-count 9)
#+END_SRC
** KILL SPC SPC as M-x
#+BEGIN_SRC emacs-lisp :tangle no
(map! :leader
      :desc "Open like spacemacs"
      "SPC" #'counsel-M-x)
#+END_SRC
* Org
** Messy
#+BEGIN_SRC emacs-lisp
(setq org-clock-persist t)
(org-clock-persistence-insinuate)
(setq org-clock-persist-query-resume nil)
;; (setq org-hide-emphasis-markers t)

(setq org-directory "~/Dropbox/Org")
(after! org
  (setq org-directory "~/Dropbox/Org"))

;;(setq +org:reading-list-file (+org/expand-org-file-name "gtd/read-list.org"))
;;(setq +org:bookmarks-file (+org/expand-org-file-name "gtd/bookmarks.org"))

(after! org
  (setq org-src-window-setup 'current-window))

(after! org-mode
  (unmap! '(motion) "C-h")
  )

(setq org-directory "~/Dropbox/org")

;; (use-package evil
;;   :custom
;;   evil-disable-insert-state-bindings t
;;   )
(setq org-emphasis-alist
      '(("/" italic)
        ("_" underline)
        ("=" org-verbatim verbatim)
        ("~" org-code verbatim)
        ("+"
         (:strike-through t))))
#+END_SRC
** Agenda
#+BEGIN_SRC emacs-lisp
;;Agenda
(setq org-agenda-files (directory-files-recursively "~/Dropbox/org/gtd/" "\\.org$"))

(use-package! org-super-agenda
  :commands (org-super-agenda-mode))
(after! org-agenda
  (org-super-agenda-mode))

(setq org-agenda-skip-scheduled-if-done t
      org-agenda-skip-deadline-if-done t
      org-agenda-include-deadlines t
      org-agenda-block-separator nil org-agenda-tags-column 100)
(setq org-agenda-custom-commands
      '(("o" "Overview"
         ((agenda "" ((org-agenda-span 'day)
                      (org-super-agenda-groups
                       '((:name "Today"
                          :time-grid t
                          :date today
                          :todo "TODAY"
                          :scheduled today
                          :order 1)))))
          (alltodo "" ((org-agenda-overriding-header "")
                       (org-super-agenda-groups
                        '((:name "Next to do"
                           :todo "NEXT"
                           :order 1)
                          (:name "Important"
                           :tag "Important"
                           :priority "A"
                           :order 6)
                          (:name "Due Today"
                           :deadline today
                           :order 2)
                          (:name "Due Soon"
                           :deadline future
                           :order 8)
                          (:name "Overdue"
                           :deadline past
                           :face error
                           :order 7)
                          (:name "Assignments"
                           :tag "Assignment"
                           :order 10)
                          (:name "Issues"
                           :tag "Issue"
                           :order 12)
                          (:name "Emacs"
                           :tag "Emacs"
                           :order 13)
                          (:name "Projects"
                           :tag "Project"
                           :order 14)
                          (:name "Research"
                           :tag "Research"
                           :order 15)
                          (:name "To read"
                           :tag "Read"
                           :order 30)
                          (:name "Waiting"
                           :todo "WAITING"
                           :order 20)
                          (:name "University"
                           :tag "uni"
                           :order 32)
                          (:name "Trivial"
                           :priority<= "E"
                           :tag ("Trivial" "Unimportant")
                           :todo ("SOMEDAY" )
                           :order 90)
                          (:discard (:tag ("Chore" "Routine" "Daily")))))))))))
#+END_SRC
