doom_emacs/.doom.d/config.org
** Capture
#+BEGIN_SRC emacs-lisp
(setq org-capture-templates '(
                              ("t" "Todo")
                              ("tn" "No time" entry
                               (file+headline "~/Dropbox/org/gtd/inbox.org" "Tasks")
                               "* TODO %^{Description} %^g\n  %?")
                              ("tt" "With time" entry
                               (file+headline "~/Dropbox/org/gtd/agenda.org" "Tasks")
                               "* TODO %^{Description} %^g\n \%^t\n  %?")


                              ("T" "Tickler" entry
                               (file+headline "~/Dropbox/org/gtd/tickler.org" "Tickler")
                               "* %i%? \n %U")

                              ("n" "Simple Notes" entry
                               (file+headline "~/Dropbox/org/gtd/inbox.org" "Notes")
                               "* %^{Description} %^g\n  %?")

                              ("j" "Journal" entry
                               (file+datetree "~/Dropbox/org/gtd/journal.org")
                               "* %U %?" :clock-in t :clock-keep t)


                              ("l" "Log")

                              ("ls" "Log SICP/LISP daily" entry
                               (file+olp+datetree "~/Dropbox/org/gtd/log.org" "SICP")
                               "* %<%H:%M>\n%^{minute}p%^{page}p%?" :jump-to-captured t :immediate-finish t)

                              ("lu" "Log UNIX daily" entry
                               (file+olp+datetree "~/Dropbox/org/gtd/log.org" "UNIX")
                               "* %<%H:%M> %^{Topic}\n%^{minute|60}p" :immediate-finish t)

                              ("r" "Resource")

                              ("ri" "Internet" entry
                               (file+olp "~/Dropbox/org/gtd/inbox.org" "Resources" "Internet")
                               "* [[%c][%^{Name of link}]] %^g\n%U\n")))
#+END_SRC
** org-download
https://zzamboni.org/post/my-doom-emacs-configuration-with-commentary/
#+BEGIN_SRC emacs-lisp
(defun zz/org-download-paste-clipboard (&optional use-default-filename)
  (interactive "P")
  (require 'org-download)
  (let ((file
         (if (not use-default-filename)
             (read-string (format "Filename [%s]: " org-download-screenshot-basename)
                          nil nil org-download-screenshot-basename)
           nil)))
    (org-download-clipboard file)))

(after! org
  (setq org-download-method 'directory)
  (setq org-download-image-dir "~/Documents/Assets/Download")
  (setq org-download-heading-lvl nil)
  (setq org-download-timestamp "%Y%m%d-%H%M%S_")
  (setq org-image-actual-width 750)
  (map! :map org-mode-map
        "C-c l a y" #'zz/org-download-paste-clipboard
        "C-M-y" #'zz/org-download-paste-clipboard))
#+END_SRC

** org bullets
#+BEGIN_SRC emacs-lisp
;; (setq
;;  ;; org-superstar-headline-bullets-list '("⁖" "*" "†" "✸" "✿")
;;  org-superstar-headline-bullets-list '("*")
;;  )
#+END_SRC
** Visual
*** KILL utf8
It also hides emphasis markers
#+BEGIN_SRC emacs-lisp :tangle no
(add-hook! 'org-mode-hook #'+org-pretty-mode )
#+END_SRC
** Keybindings
#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "org-ctrl-c-star copy"
      "8" 'org-ctrl-c-star)
#+END_SRC
** Automaticalyl add new list item
#+BEGIN_SRC emacs-lisp
(org-autolist-mode 1)
#+END_SRC
** Org Log Done
#+BEGIN_SRC emacs-lisp
(setq org-log-done 'time)
#+END_SRC

#+RESULTS:
: time

* Translator
** KILL Google Translate
#+BEGIN_SRC emacs-lisp :tangle no
(use-package google-translate
  :custom
  (google-translate-backend-method 'curl)
  (google-translate-default-source-language "en")
  (google-translate-default-target-language "tr")
  :config
  (defun google-translate--search-tkk () "Search TKK." (list 430675 2721866130)))
(map! :leader
      :desc "Translate word"
      "d l" 'google-translate-at-point
      )
#+END_SRC
** TODO Offline
* Bookmark like
** notes
#+BEGIN_SRC emacs-lisp
(map! :leader
      :desc "Go to notes directory"
      "a n" 'my/notes-counsel-find-file
      )

(defun my/notes-counsel-find-file ()
  "Foobar"
  (interactive)
  (counsel-find-file "/home/umut/Dropbox/org/Notes"))
#+END_SRC
** gtd
#+BEGIN_SRC emacs-lisp
(defun my/gtd-counsel-find-file ()
  "Foobar"
  (interactive)
  (counsel-find-file "/home/umut/Dropbox/org/gtd"))

(map! :leader
      :desc "Go to notes directory"
      "a g" 'my/gtd-counsel-find-file
      )
#+END_SRC
** src
#+BEGIN_SRC emacs-lisp
(defun my/src-counsel-find-file ()
  "Foobar"
  (interactive)
  (counsel-find-file "/home/umut/src/"))

(map! :leader
      :desc "Go to notes directory"
      "a s" 'my/src-counsel-find-file
      )
#+END_SRC
** documents
#+BEGIN_SRC emacs-lisp
(defun my/documents-counsel-find-file ()
  "Foobar"
  (interactive)
  (counsel-find-file "/home/umut/Document/"))

(map! :leader
      :desc "Go to documents directory"
      "a d" 'my/documents-counsel-find-file
      )
#+END_SRC
* Functions
** Mine
*** Curly to Normal Quote
#+BEGIN_SRC emacs-lisp
(defun my/curly-quoation-to-normal-quoation()
  "Change any curly quotation mark to normal quoation mark"
  (interactive)
  (goto-char (point-min))
  (while (search-forward "‘" nil t)
    (replace-match "'"))
  (goto-char (point-min))
  (while (search-forward "’" nil t)
    (replace-match "'"))

  (goto-char (point-min))
  (while (search-forward "“" nil t)
    (replace-match "\""))

  (goto-char (point-min))
  (while (search-forward "”" nil t)
    (replace-match "\""))
  )
#+END_SRC
*** Debug Functions
#+BEGIN_SRC emacs-lisp
(defun my/error-line ()
  "Create an error message in C++"
  (interactive)
  (move-beginning-of-line nil)
  (insert "std::cout << \"Error:\" << __LINE__ << std::endl;")
  )

(map! :leader
      :desc "Create an error message in C++"
      "d e" 'my/error-line
      )
#+END_SRC
*** Open a folder
#+BEGIN_SRC emacs-lisp
(defun my/open-folder ()
  "Opens a folder with xdg-open"
  (interactive)
  (shell-command "xdg-open ."))
#+END_SRC
*** Org Table y n
Very hacky but it works.
#+BEGIN_SRC emacs-lisp
(defun my/org-table-color-y-n (start end)
  "Make =y= s green and n s red with =y= and ~n~"
  (interactive "r")
  (replace-regexp " y " " =y= " nil start end)
  (replace-regexp " n " " ~n~ " nil start end))
#+END_SRC
*** Just one space in region
https://stackoverflow.com/questions/8674912/how-to-collapse-whitespaces-in-a-region
#+BEGIN_SRC emacs-lisp
(defun my/just-one-space-in-region (beg end)
  "replace all whitespace in the region with single spaces"
  (interactive "r")
  (save-excursion
    (save-restriction
      (narrow-to-region beg end)
      (goto-char (point-min))
      (while (re-search-forward "\\s-+" nil t)
        (replace-match " ")))))

(map! :leader
      :desc "Go to documents directory"
      "j s" 'my/my/just-one-space-in-region)
#+END_SRC
** xah lee
