doom_emacs/.doom.d/config.org
*** TODO Open File Under Cursor
#+BEGIN_SRC emacs-lisp
(defun xah-open-file-at-cursor ()
  "Open the file path under cursor.
If there is text selection, uses the text selection for path.
If the path starts with “http://”, open the URL in browser.
Input path can be {relative, full path, URL}.
Path may have a trailing “:‹n›” that indicates line number. If so, jump to that line number.
If path does not have a file extension, automatically try with “.el” for elisp files.
This command is similar to `find-file-at-point' but without prompting for confirmation.

URL `http://ergoemacs.org/emacs/emacs_open_file_path_fast.html'
Version 2019-01-16"
  (interactive)
  (let* (($inputStr (if (use-region-p)
                        (buffer-substring-no-properties (region-beginning) (region-end))
                      (let ($p0 $p1 $p2
                                ;; chars that are likely to be delimiters of file path or url, e.g. whitespace, comma. The colon is a problem. cuz it's in url, but not in file name. Don't want to use just space as delimiter because path or url are often in brackets or quotes as in markdown or html
                                ($pathStops "^  \t\n\"`'‘’“”|[]{}「」<>〔〕〈〉《》【】〖〗«»‹›❮❯❬❭〘〙·。\\"))
                        (setq $p0 (point))
                        (skip-chars-backward $pathStops)
                        (setq $p1 (point))
                        (goto-char $p0)
                        (skip-chars-forward $pathStops)
                        (setq $p2 (point))
                        (goto-char $p0)
                        (buffer-substring-no-properties $p1 $p2))))
         ($path
          (replace-regexp-in-string
           "^file:///" "/"
           (replace-regexp-in-string
            ":\\'" "" $inputStr))))
    (if (string-match-p "\\`https?://" $path)
        (if (fboundp 'xahsite-url-to-filepath)
            (let (($x (xahsite-url-to-filepath $path)))
              (if (string-match "^http" $x )
                  (browse-url $x)
                (find-file $x)))
          (progn (browse-url $path)))
      (if ; not starting “http://”
          (string-match "^\\`\\(.+?\\):\\([0-9]+\\)\\'" $path)
          (let (
                ($fpath (match-string 1 $path))
                ($line-num (string-to-number (match-string 2 $path))))
            (if (file-exists-p $fpath)
                (progn
                  (find-file $fpath)
                  (goto-char 1)
                  (forward-line (1- $line-num)))
              (when (y-or-n-p (format "file no exist: 「%s」. Create?" $fpath))
                (find-file $fpath))))
        (if (file-exists-p $path)
            (progn ; open f.ts instead of f.js
              (let (($ext (file-name-extension $path))
                    ($fnamecore (file-name-sans-extension $path)))
                (if (and (string-equal $ext "js")
                         (file-exists-p (concat $fnamecore ".ts")))
                    (find-file (concat $fnamecore ".ts"))
                  (find-file $path))))
          (if (file-exists-p (concat $path ".el"))
              (find-file (concat $path ".el"))
            (when (y-or-n-p (format "file no exist: 「%s」. Create?" $path))
              (find-file $path ))))))))

(map! :leader
      :desc "Translate word"
      "d f" 'xah-open-file-at-cursor
      )
#+END_SRC
*** Title Case
#+BEGIN_SRC emacs-lisp
(defun xah-title-case-region-or-line (@begin @end)
  "Title case text between nearest brackets, or current line, or text selection.
Capitalize first letter of each word, except words like {to, of, the, a, in, or, and, …}. If a word already contains cap letters such as HTTP, URL, they are left as is.

When called in a elisp program, *begin *end are region boundaries.
URL `http://ergoemacs.org/emacs/elisp_title_case_text.html'
Version 2017-01-11"
  (interactive
   (if (use-region-p)
       (list (region-beginning) (region-end))
     (let (
           $p1
           $p2
           ($skipChars "^\"<>(){}[]“”‘’‹›«»「」『』【】〖〗《》〈〉〔〕"))
       (progn
         (skip-chars-backward $skipChars (line-beginning-position))
         (setq $p1 (point))
         (skip-chars-forward $skipChars (line-end-position))
         (setq $p2 (point)))
       (list $p1 $p2))))
  (let* (
         ($strPairs [
                     [" A " " a "]
                     [" And " " and "]
                     [" At " " at "]
                     [" As " " as "]
                     [" By " " by "]
                     [" Be " " be "]
                     [" Into " " into "]
                     [" In " " in "]
                     [" Is " " is "]
                     [" It " " it "]
                     [" For " " for "]
                     [" Of " " of "]
                     [" Or " " or "]
                     [" On " " on "]
                     [" Via " " via "]
                     [" The " " the "]
                     [" That " " that "]
                     [" To " " to "]
                     [" Vs " " vs "]
                     [" With " " with "]
                     [" From " " from "]
                     ["'S " "'s "]
                     ["'T " "'t "]
                     ]))
    (save-excursion
      (save-restriction
        (narrow-to-region @begin @end)
        (upcase-initials-region (point-min) (point-max))
        (let ((case-fold-search nil))
          (mapc
           (lambda ($x)
             (goto-char (point-min))
             (while
                 (search-forward (aref $x 0) nil t)
               (replace-match (aref $x 1) "FIXEDCASE" "LITERAL")))
           $strPairs))))))

(map! :leader
      "j t"  'xah-title-case-region-or-line
      )
#+END_SRC
* Languages
** KILL C/C++
#+BEGIN_SRC emacs-lisp :tangle no
(defun my-compile-run ()
  (interactive)
  (save-buffer)
  (if (get-buffer "vterm")
      (setq cur-term "vterm")
    (setq cur-term "*doom:vterm-popup:main*")
    )
  (comint-send-string cur-term
                      (concat "clear"
                              "\n"
                              "g++ *.cpp"
                              ";"
                              "./a.out"
                              "\n")))

(defun my-compile-run-with-test ()
  (interactive)
  (save-buffer)
  (if (get-buffer "vterm")
      (setq cur-term "vterm")
    (setq cur-term "*doom:vterm-popup:main*")
    )
  (comint-send-string cur-term (concat "clear"
                                       "\n"
                                       "g++ "
                                       (buffer-name)
                                       ";"
                                       "./a.out"
                                       "<test"
                                       "\n")))

(map! :leader
      :desc "Compile and Run in vterm buffer"
      "d c"  'my-compile-run
      "d t"  'my-compile-run-with-test
      )
#+END_SRC

** Notes :info:
For syntax cechking I'm using flycheck
*** Flycheck
=(global-flycheck-mode)= is already enabled in doom.
[[https://www.flycheck.org/en/latest/user/flycheck-versus-flymake.html#flycheck-versus-flymake][Why not flymake ?]]
** Scheme
*** MIT
#+BEGIN_SRC emacs-lisp :tangle no
(setq geiser-mit-binary "/usr/bin/scheme")
(setq geiser-active-implementations '(mit))
(setq geiser-scheme-implementation 'mit)
(setq scheme-program-name "/usr/local/bin/mit-scheme")
(setq geiser-scheme-implementation 'mit)
(setq geiser-default-implementation 'mit)
#+END_SRC

** C++
*** Org default setup for C++
#+BEGIN_SRC emacs-lisp
(setq org-babel-default-header-args:C++ '((:includes . "<bits/stdc++.h>")
                                          (:flags . "-std=c++20")
                                          (:namespaces . "std")))
#+END_SRC
*** Error List
Run =(lsp-ui-flycheck-list)=
** C
*** Org default setup for C
#+BEGIN_SRC emacs-lisp
(setq org-babel-default-header-args:C '((:includes . "'(<stdio.h> <stdlib.h> <unistd.h> <time.h> <string.h>)")
                                        (:flags . "-std=c99")))
#+END_SRC


** Python
*** Keybindgins
Currently SPC [j k l] is empty for me
#+BEGIN_SRC emacs-lisp
(map! :leader
      "j r" 'python-shell-send-region
      "j b" 'python-shell-send-buffer
      "j d" 'python-shell-send-defun)
#+END_SRC
*** Error list
* Packages
** Company
*** Company Behaviour
#+BEGIN_SRC emacs-lisp
(after! company
  (setq company-idle-delay 0.35)
  (setq company-minimum-prefix-length 1)
  (setq company-selection-wrap-around t);;Circular list
  (setq company-show-numbers t));; M-7 for 7nd match
#+END_SRC
*** Select with tab
#+BEGIN_SRC emacs-lisp
(after! company
  (define-key company-active-map (kbd "<tab>")
    #'company-complete-selection)
  (define-key company-active-map (kbd "TAB")
    #'company-complete-selection))
#+END_SRC

*** Company ui
#+BEGIN_SRC emacs-lisp
(after! company
  (setq company-tooltip-limit 10
        company-tooltip-minimum-width 80))
#+END_SRC

** TODO Treemacs
Add +treemacs-git-mode
#+BEGIN_SRC emacs-lisp
(setq doom-themes-treemacs-theme "doom-colors")
(doom-themes-treemacs-config)
#+END_SRC

** Command Log Mode
#+BEGIN_SRC emacs-lisp
(use-package command-log-mode)
#+END_SRC
** Artist Mode Right Click
#+BEGIN_SRC emacs-lisp
(eval-after-load "artist"
  '(define-key artist-mode-map [(down-mouse-3)] 'artist-mouse-choose-operation)
  )
#+END_SRC
