doom_emacs/.doom.d/config.org
** Pdf
*** Dark Mode
#+BEGIN_SRC emacs-lisp
(add-hook 'pdf-tools-enabled-hook 'pdf-view-midnight-minor-mode) ;Dark mode
#+END_SRC
*** Latex Viewer
#+BEGIN_SRC emacs-lisp
(setq +latex-viewers '(pdf-tools))
#+END_SRC
*** org-file-apps
#+BEGIN_SRC emacs-lisp
(push '("\\.pdf\\'" . emacs) org-file-apps)
#+END_SRC
** Epub
#+BEGIN_SRC emacs-lisp
(use-package! nov
  :mode ("\\.epub\\'" . nov-mode)
  :config
  (setq nov-save-place-file (concat doom-cache-dir "nov-places")))
#+END_SRC
** info-colors
#+BEGIN_SRC emacs-lisp
(use-package! info-colors
  :commands (info-colors-fontify-node))

(add-hook 'Info-selection-hook 'info-colors-fontify-node)
(add-hook 'Info-mode-hook #'mixed-pitch-mode)
#+END_SRC
** tools/rgb
*** hl-line-mode don't override rainbow
#+BEGIN_SRC elisp
(add-hook! 'rainbow-mode-hook
  (hl-line-mode (if rainbow-mode -1 +1)))
#+END_SRC
*** TODO global rainbow mode
*** kurecolor functions
**** ++
kurecolor-increase-hue-by-step
kurecolor-increase-saturation-by-step
kurecolor-increase-brightness-by-step
**** --
kurecolor-decrease-hue-by-step
kurecolor-decrease-saturation-by-step
kurecolor-decrease-brightness-by-step
** tools/lsp
[[https://emacs-lsp.github.io/lsp-mode/tutorials/how-to-turn-off/][Lsp Features List]]
Doom emacs's defaults are good for me
*** Don't highlight same symbol
If I want to look at same symbol then I probably want to go there
`*` does this, also it highlight too
#+BEGIN_SRC emacs-lisp
(setq lsp-enable-symbol-highlighting nil)
#+END_SRC
*** Code Action
Code actions are lsp's way to fix code.
Can run with =(lsp-execute-code-action)= ,in doom emacs SPC c a
#+BEGIN_SRC emacs-lisp :tangle no
(setq lsp-modeline-code-actions-segments '(count icon name))
#+END_SRC
*** Breadcrumb :info:
Fancy way to show where you are in header
Run with =(lsp-headerline-breadcrumb-mode)=
*** lsp-treemacs
M-x =(lsp-treemacs-symbols)= for cool outline.
M-x =(lsp-treemacs-errors-list)= Fancier way than lsp-ui-sideline
*** lsp-ivy
Search through entire project(in headers too).
** ui/zen
*** Writeroom width limit
I generaly use lightrom for reading text-info manuals or manuals in one screen.
I don't need 80 column restriciton
#+BEGIN_SRC emacs-lisp
(setq  writeroom-width 80)
#+END_SRC
** completion/ivy
M-i for insert what you select.
~  for go home
// for go root
`  for narrow down to projectile
** tools/lookup
| SPC g f | Look for a file , named the word under cursor |
| SPC s O | Look online                                   |
** Delimcol
#+BEGIN_SRC emacs-lisp
(setq delimit-columns-str-before "{ ")
(setq delimit-columns-str-after " }")
(setq delimit-columns-str-separator ", ")
(setq delimit-columns-before "")
(setq delimit-columns-after "")
(setq delimit-columns-separator " ")
(setq delimit-columns-format 'separator)
(setq delimit-columns-extra t)

(map! :leader
      "j [" 'delimit-columns-region)
#+END_SRC
* Personal Packages
** Zeal
#+BEGIN_SRC emacs-lisp
(use-package zeal-at-point)
(map! :leader
      :desc "Zeal Look Up"
      "d z" #'zeal-at-point
      )
#+END_SRC
** Buffer Position Managment (framemove)
#+BEGIN_SRC emacs-lisp
(use-package! framemove
  :config
  (setq framemove-hook-into-windmove t))
#+END_SRC
** TODO Turkish Mode
#+BEGIN_SRC emacs-lisp
(use-package turkish)
(map! :leader
      :desc "Turkish last word"
      "d t" 'turkish-correct-last-word
      )
#+END_SRC
**  evil-visual-mark-mode
